back/app/Controllers/Home.php

SELECT *
FROM `ordinateur`
---
    public function index(): string
    {
        $this->response->setContentType('application/json');
        $model = new Ordinateurs();
        $data = $model->findAll();