back/app/Controllers/Home.php

SELECT *
FROM `inscription`
---
    public function index(): string
    {
        $this->response->setContentType('application/json');
        $model = new Inscription();
        $data = $model->findAll();